{
    "projects": [
        {
          "id": 0,
          "title": "Colorator",
          "img": "images/colorator.png",
          "description": "A self-initiated project to build & design a colour palette tool and sharing platform. I used React to make a dynamic front-end with usability and UX paramount to the design. I used Laravel to create an API to manage users, palettes and likes, with Sanctum implemented to handle user logins via API tokens. Fully tested with Laravels testing capabilities",
          "section": "project-1",
          "livelink": "https://colorator-app.vercel.app/",
          "github": "https://github.com/Benpeake/colorator-app",
          "tech": "React / Laravel",
          "synops": "A colour palette tool that allows a user to build, customise, save, and share colour palettes, as well as like other users palettes."

        },

        {
          "id": 1,
          "title": "Viridis",
          "img": "images/viridis.png",
          "description": "Website design and build for local garden design business. The website is fully responsive and utilises JavaScript to implement interactive elements that imporive the flow of the site and experience for the user.",
          "section": "project-3",
          "livelink": "https://benpeake.github.io/viridis-site/",
          "github": "https://github.com/Benpeake/viridis-site",
          "tech": "HTML / CSS / JavaScript",
          "synops": "Website design and build for local garden design business."
        },
    
        {
          "id": 2,
          "title": "My-Records",
          "img": "images/collection-app.png",
          "description": "A collection app that allows a user to maintain and show off their record collection. Created using OOP principles with vanilla PHP and a MySQL database, without a framework in order to gain a deeper understanding of CRUD operations. This was an individual project with pull request reviews required upon the completion of each story and is fully unit tested.",
          "section": "project-2",
          "livelink": "https://2023-benp.dev.io-academy.uk/collection/index.php",
          "github": "https://github.com/Benpeake/collection",
          "tech": "PHP / MySQL",
          "synops": "A collection app that allows a user to maintain and show off their record collection."
        }
 
      ]
}
    